log/sen/20140613-1503/aws_test_sen.xml
<?xml version="1.0"?><tsung loglevel="notice" version="1.0">

    <clients>
      <client host="localhost" maxusers="50000" use_controller_vm="true"/>
    </clients>

    <servers>
        <server host="aws-server1" port="80" type="tcp"/>
        <server host="aws-server2" port="80" type="tcp"/>
    </servers>

    <monitoring>
        <monitor host="localhost" type="erlang"/>
        <monitor host="aws-server1" type="erlang"/>
        <monitor host="aws-server2" type="erlang"/> 
    </monitoring>

    <load loop="1">
        <arrivalphase phase="1" duration="30" unit="second">
            <users arrivalrate="1" unit="second"/>
        </arrivalphase>
        <arrivalphase phase="2" duration="60" unit="second">
            <users arrivalrate="10" unit="second"/>
        </arrivalphase>
        <arrivalphase phase="3" duration="30" unit="second">
            <users arrivalrate="1" unit="second"/>
        </arrivalphase>
    </load>

    <options>
        <option name="file_server" id="maclist" value="./maclist.csv"/>
        <option name="file_server" id="devlist" value="./devlist.csv"/>
    </options>

    <sessions>

        <session name="send" weight="1" type="ts_http">
            <setdynvars sourcetype="file" fileid="devlist" delimiter="\n" order="random">
                <var name="dev"/>
            </setdynvars>
            <transaction name="send">
                <request subst="true">
                    <http url="/ds/send/%%_dev%%" method="POST" content_type="application/json" contents="{&quot;current&quot;:0.5,&quot;power&quot;:4,&quot;state&quot;:&quot;on&quot;}"/>
                </request> 
            </transaction>
        </session>

  </sessions>

</tsung>